const Regs = {
  // 匹配邮箱
  'EMAIL': /^([a-zA-Z]|[0-9])(\w|\-)+@[a-zA-Z0-9]+\.([a-zA-Z]{2,4})$/,
  // 匹配手机号
  'PHONE': /^1[0-9]{10}$/,
  // 匹配8-16为数字和字母密码的正则表达式
  'PASSWORD': /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{8,16}$/,
  // 匹配国内电话号码
  'CHINAPHONE': /\d{3}-\d{8}|\d{4}-\d{7}/,
  // 匹配身份证号码
  'IDNUMBER': /(^\d{15}&)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
  // 匹配QQ号
  'QQ': /[1-9][0-9]{4,}/,
  // 匹配ip地址
  'IPADDRESS': /\d+\.\d+\.\d+\.\d+/,
  // 匹配中文
  'CHAINESE': /^[\u4e00-\u9fa5]*$/,
}

module.exports = {
  Regs: Regs
}